0/gas/ph_rgh.orig
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
  {
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      ph_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions [ 1 -1 -2 0 0 0 0 ];

internalField uniform 1e5;

boundaryField
  {
    ".*"
    {
      type fixedFluxPressure;
      value $internalField;
    }
    outlet
    {
      type fixedValue;
      value uniform 1e5;
    }
    #includeEtc "caseDicts/setConstraintTypes"
  }

// ************************************************************************* //
