constant/gas/physicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
  version     2.0;
  format      ascii;
  class       dictionary;
  object      thermophysicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermoType
{
  type            heRhoThermo;
  mixture         pureMixture;
  transport       const;
  thermo          hConst;
  equationOfState perfectGas;
  energy          sensibleEnthalpy;
  specie          specie;
}

mixture
{
  specie
  {
    molWeight 2.01588;
  }
  thermodynamics
  {
    Hf 0.0;
    Sf 0;
    Cp 12000;

  }
  transport
  {
    mu 0.99323e-6;
    kappa 0.016765;
  }
}


// ************************************************************************* //
