system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

libs
(
  "libbuoyancyTurbSourceFvModels.so"                 // buoyancySourceTerm
  "libcompressibleBuoyantMomentumTransportModels.so" // v2fBuoyant
);

application foamMultiRun;

regionSolvers 
{
  gas     fluid;
  // liquid  fluid;
  // #if ${${FOAM_CASE}/parameters!wall} 
  //   metal   solid;
  // #else
  // #endif
}

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime 5.00;

deltaT 0.01;

writeControl    adjustableRunTime;

writeInterval 0.1;

purgeWrite      50;

writeFormat     binary;

writePrecision  9;

compression     off;

timeFormat      general;

timePrecision   9;

runTimeModifiable yes;

adjustTimeStep false;

// Solid diffusion control is removed in dev version, set to very high number here.
// https://github.com/OpenFOAM/OpenFOAM-dev/commit/e748a12d18423bb5e46188800d2ba36352843f3c
maxDi           1e6; 

maxCo 0.5;

// ************************************************************************* //
