system/gas/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
#include "$FOAM_CASE/parameters"

solvers
{
    "rho.*"
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       0;
        relTol          0;
    }
    "f.*"
    {
        solver          PBiCGStab;
        preconditioner  DIC;
        tolerance       1e-9;
        relTol          0.0;
    }

    p_rgh
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-10;
        relTol          0.01;
    }
    ph_rgh
    {
      $p_rgh;
      relTol          0;
    }

    p_rghFinal
    {
        $p_rgh;
        relTol          0;
    }

    "(U|h|e|k|v2|epsilon|R|omega)"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-8;
        relTol          0.1;
    }

    "(U|h|e|k|v2|epsilon|R|omega)Final"
    {
        $U;
        relTol          0;
    }
}
PIMPLE
{
    momentumPredictor yes;
    nOuterCorrectors  1;
    nCorrectors       3;
    nNonOrthogonalCorrectors 2;
    // ddtCorr           yes;
    // maxCo             $maxCo;
    // rDeltaTSmoothingCoeff 0.1;
    // rDeltaTDampingCoeff 0.5;
    // maxDeltaT         1;
    hydrostaticInitialisation $hydrostaticInitialisation;
    nHydrostaticCorrectors 15;
    // consistent yes;

    outerCorrectorResidualControl
    {
        "(p_rgh|e|h)"
        {
            tolerance       1e-3;
            relTol          0;
        }
        U
        {
          tolerance 1e-2;
          relTol    0;
        }
    }

    transportCorrectionFinal no;
}

// relaxationFactors
// {
//   equations
//   {
//     ".*" 1;
//   }
// }

relaxationFactors
{
  fields
  {
    p_rgh 1;
    rho 1;
    ".*Final" 1;
  }
  equations
  {
    U 0.9;
    "(h|e)" 0.7;
    "(k|epsilon|omega|v2|f)" 0.8;
    ".*Final" 1;
  }
}


